const zh = {
  menuList: {
    'Dashboard': '首页',
    'Demo': '例子',
    '新增Demo': '新增例子',
    '查看': '查看',
    'Edit': '编辑',
    'Delete': '删除',
    '新手引导': '新手引导',
    '备忘录': '备忘录',
    '新增事件': '新增事件',
    '置顶': '置顶',
    '待办列表': '待办列表',
    '完成': '完成',
    'DELETE': '删除',
    '分享': '分享',
    '更多': '更多',
    '新增事项': '新增事项',
    '图表': '图表',
    'Echarts': 'Echarts',
    '文件': '文件',
    '下载文件': '下载文件',
    '下载': '下载',
    '预览': '预览',
    '嵌套路由': '嵌套路由',
    '路由-1': '路由-1',
    '路由-1-1': '路由-1-1',
    '路由-1-2': '路由-1-2',
    '路由-1-3': '路由-1-3',
    '路由-1-2-1': '路由-1-2-1',
    '路由-1-2-2': '路由-1-2-2',
    '路由-1-2-3': '路由-1-2-3',
    '路由-2': '路由-2',
    '工具类': '工具类',
    'Clipboard': '剪贴板',
    'Viewer': '图片查看器',
    'VueDraggable': '列表拖拽',
    '二维码': '二维码',
    '地图': '地图',
    '百度地图': '百度地图',
    '权限管理': '权限管理',
    '权限菜单': '权限菜单',
    '新增用户': '新增用户',
    '方便测试': '方便测试'
  },
  Demo: {
    '新增Demo': '新增例子',
    'placeholder': '描述',
    '查看': '查看',
    'Edit': '编辑',
    'Delete': '删除',
    'Order': '序号',
    'CreatedTime': '创建时间',
    'Desc': '描述',
    'Path': '路径',
    'Operation': '操作',
    '刷新列表': '刷新列表成功',
    Comfirm: {
      Delete: {
        Tip: '温馨提示',
        Content: '此操作将永久删除该数据, 是否继续?',
        '确定': '确 定',
        '取消': '取 消',
        '已取消删除': '已取消删除'
       }
    },
    Dialog: {
      Add: {
        Title: '新增Demo'
      },
      Edit: {
        Title: '编辑Demo'
      },
      '描述': '描 述',
      '描述Placeholder': '请输入demo相关的描述',
      '路径': '路 径',
      '路径Placeholder': '请输入demo相关的路径',
      '内容': '内 容',
      '取消': '取 消',
      '确定': '确 定'
    }
  },
  Guide: {
    '新手引导': '新手引导',
    Collapse: {
      Title: '导航栏状态切换按钮',
      Desc: '可以控制导航栏的显示 && 隐藏'
    },
    Breadcrum: {
      Title: '系统面包屑',
      Desc: '显示当前路由的所在层级'
    },
    Screen: {
      Title: '全屏化',
      Desc: '将当前界面放大至整个浏览器'
    },
    Search: {
      Title: '路由搜索',
      Desc: '可以使用关键字搜索当前的所有路由，并跳转'
    },
    Multilingual: {
      Title: '多语言设置',
      Desc: '可以在这里切换系统的语言'
    },
    User: {
      Title: '用户中心',
      Desc: '查看用户信息 && 系统设置'
    },
    Tab: {
      Title: 'tabs菜单栏',
      Desc: '可以在这里跳转页面'
    }
  },
  Memerandum: {
    '新增事件': '新增事件',
    '开始日期': '开始日期',
    '结束日期': '结束日期',
    '请选择': '请选择',
    'Order': '序号',
    'CreatedTime': '创建时间',
    'Desc': '描述',
    'Tags': '标签',
    'Operation': '操作',
    '查看': '查看',
    'Edit': '编辑',
    'Delete': '删除',
    '设为置顶': '设为置顶',
    '取消置顶': '取消置顶',
    '刷新列表': '刷新列表成功',
    Comfirm: {
      Delete: {
       Tip: '温馨提示',
       Content: '此操作将永久删除该数据, 是否继续?',
       '确定': '确 定',
       '取消': '取 消',
       '已取消删除': '已取消删除'
      },
      Top: {
       Tip: '温馨提示',
       Content: '此操作将永久修改该数据, 是否继续?',
       '确定': '确 定',
       '取消': '取 消',
       '已取消删除': '已取消删除'
      }
     },
    Dialog: {
      Add: {
        Title: '新增备忘录事件'
      },
      Edit: {
        Title: '编辑备忘录事件'
      },
      '事件描述': '事件描述',
      '事件Tags': '事件标签',
      '事件内容': '事件内容',
      '预览': '预 览',
      '取消': '取 消',
      '确定':'确 定',
      '新增标签': '新增标签',
      '最大标签数': '最大个数不能超过3'
    }
  },
  WaitingTodo: {
    '新增事项': '新增事项',
    '开始日期': '开始日期',
    '结束日期': '结束日期',
    '事件级别': '事件级别',
    '是否完成': '是否完成',
    '描述': '描述',
    'Order': '序号',
    'CreatedTime': '创建时间',
    'Desc': '描述',
    'Rank': '级别',
    'isFinish': '是否完成',
    'Operation': '操作',
    '切至已完': '切至已完',
    '切至未完': '切至未完',
    '设为置顶': '设为置顶',
    '取消置顶': '取消置顶',
    'Delete': '删除',
    '刷新列表': '刷新列表成功',
    '等级枚举': {
      '一般': '一般',
      '重要': '重要',
      '非常重要': '非常重要'
    },
    '完成枚举': {
      '是': '是',
      '否': '否'
    },
    Comfirm: {
     Delete: {
      Tip: '温馨提示',
      Content: '此操作将永久删除该数据, 是否继续?',
      '确定': '确 定',
      '取消': '取 消',
      '已取消删除': '已取消删除'
     },
     Finish: {
      Tip: '温馨提示',
      Content: '此操作将永久修改该数据, 是否继续?',
      '确定': '确 定',
      '取消': '取 消',
      '已取消删除': '已取消删除'
     },
     Top: {
      Tip: '温馨提示',
      Content: '此操作将永久修改该数据, 是否继续?',
      '确定': '确 定',
      '取消': '取 消',
      '已取消删除': '已取消删除'
     }
    },
    Dialog: {
      Title: '新增待办列表事项',
      '描述': '描 述',
      '描述提示': '相关描述不能为空',
      '描述占位符': '请输入相关描述',
      '等级': '等 级',
      '取消': '取 消',
      '确定': '确 定',
    }
  },
  Charts: {
    Echarts: {
      '折线图': '折线图',
      '柱形图': '柱形图',
      '饼形图': '饼形图',
      Pie: {
        '直接访问': '直接访问',
        '邮件营销': '邮件营销',
        '联盟广告': '联盟广告',
        '视频广告': '视频广告',
        '搜索引擎': '搜索引擎',
        '访问来源': '访问来源'
      },
      Week: {
        'Mon': '周一',
        'Tue': '周二',
        'Wed': '周三',
        'Thu': '周四',
        'Fri': '周五',
        'Sat': '周六',
        'Sun': '周日'
      }
    }
  },
  Files: {
    Download: {
      'Type': '文件类型',
      'Desc': '描述',
      'Url': '下载路径',
      'Operation': '操作',
      '下载': '下载',
      '预览': '预览',
      '不支持': '暂不支持在线预览 blob 格式的非PDF文件',
      Dialog: {
        '文件查看器': '文件查看器',
        '取消': '取 消',
        '确定': '确 定'
      }
    }
  },
  NestedRoutes: {
    'Routes-1': '我是嵌套路由第一层',
    'Routes-2': '我是嵌套路由第二层',
    'Routes-3': '我是嵌套路由第三层',
    'Routes-4': '我是嵌套路由第四层',
    'menu-1': '菜单-1',
    'menu-1-1': '菜单-1-1',
    'menu-1-2': '菜单-1-2',
    'menu-1-2-1': '菜单-1-2-1',
    'menu-1-2-2': '菜单-1-2-2',
    'menu-1-2-3': '菜单-1-2-3',
    'menu-1-3': '菜单-1-3',
    'menu-2': '菜单-2',
    'menu-3': '菜单-3',
  },
  Tools: {
    Clipboard: {
      text1: '1、通过指令传值的形式来实现复制功能 v-clipboard=\'"scscscsc"\'',
      button1: '我是要被复制的文本（可动态修改）',
      text2: '2、通过指令绑定元素的某个属性(如：clipboard-data)来传值 clipboard-data=\'scscascsa\'',
      inputPlaceholder: '请输入内容',
      Copy: '复制'
    }
  },
  PermissionMenu: {
    '新增用户': '新增用户',
    '开始日期': '开始日期',
    '结束日期': '结束日期',
    '权限级别': '权限级别',
    '搜素关键词': '姓名/号码',
    'Order': '序号',
    'CreatedTime': '创建时间',
    'Name': '姓名',
    'Role': '权限',
    'Mobile': '号码',
    'Operation': '操作',
    'Edit': '编辑',
    'Delete': '删除',
    '登录': '登录',
    Comfirm: {
      Tip: '温馨提示',
      Content: '此操作将永久修改该数据, 是否继续?',
      '确定': '确 定',
      '取消': '取 消',
      '已取消删除': '已取消删除'
     },
    '刷新': '修改自身数据，需要中心刷新页面才能生效',
    RoleRankEnum: {
      '普通用户': '普通用户',
      '管理员': '管理员',
      '超级管理员': '超级管理员'
    }
  },
  AddUserPage: {
    '账号': '账户',
    '密码': '密码',
    '名称': '名称',
    '号码': '号码',
    '头像': '头像',
    '级别': '级别',
    '描述': '描述',
    '权限菜单': '权限菜单',
    '添加': '添加'
  },
  EditUserPage: {
    '账号': '账 户',
    '密码': '密 码',
    '名称': '名 称',
    '号码': '号 码',
    '头像': '头 像',
    '级别': '级 别',
    '描述': '描 述',
    '权限菜单': '权限菜单',
    '创建时间': '创建时间',
    '保存': '保 存'
  },
  userCenterDrop: {
    '个人中心': '个人中心',
    '首页': '首页',
    '系统布局': '系统布局',
    '退出登录': '退出登录'
  },
  SystemLayoutConfig: {
    '系统布局配置': '系统布局配置',
    'Tags-View': '开启 Tags-View',
    'Aside': '固定 Aside',
    'Logo': '侧边栏 Logo',
    'Header': '固定 Header',
    'Multilingual': '开启多语言'
  },
  Map: {
    BaiduMap: {
      '周边信息': '周边信息',
      '其他类型': '其他类型',
      'InputPlaceholder': '请输入查询的具体地名',
      'InputSearchButtons': '搜索',
      '交通': '交通',
      '公交站': '公交站',
      '地铁站': '地铁站',
      '商超': '商超',
      '商场': '商场',
      '超市': '超市',
      '美食': '美食',
      '咖啡厅': '咖啡厅',
      '酒吧': '酒吧',
      '公园': '公园',
      '景点': '景点',
      '药店': '药店',
    }
  },
  Router: {
    NotMenuRoutes: {
      '个人中心': '个人中心',
      '用户权限修改页面': '用户权限修改页面',
      '新增用户页面': '新增用户页面',
      'Form表单验证': 'Form表单验证',
      '选择并过滤掉已选的item': '选择并过滤掉已选的item',
      '404页面': '404页面',
      '返回': '返回'
    }
  },
  '复制成功': '复制成功',
  '复制内容不能为空': '复制内容不能为空'
};

export default zh;
